Конфигурация/AccumulationRegisters/БаллыОпыта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>БаллыОпыта</Name>
			<Comment>Оборотный регистр накопления баллов опыта обучающихся.</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеБаллов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаБейджа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныНачисленияБаллов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ОценкиПодготовленностиПоТемам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОценкиПодготовленностиПоТемам</Name>
			<Comment>Срез последних оценок θ обучающихся по темам. Периодический по секунде.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РейтинговыеПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РейтинговыеПозиции</Name>
			<Comment>Снимок рейтинга обучающихся в учебных группах. Периодический по дню.</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ранг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ТипыСобытийАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСобытийАналитики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОткрытиеМатериала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоСессииТеста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗадание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеБейджа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Простой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ПричиныНачисленияБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныНачисленияБаллов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВерныйОтвет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеТемы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрохождениеКурса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеБейджа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучноеНачисление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/НачислениеБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеБаллов</Name>
			<Comment>Хозяйственная операция начисления баллов опыта обучающемуся</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БаллыОпыта</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныНачисленияБаллов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаБейджа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ВыдачаБейджа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыдачаБейджа</Name>
			<Comment>Хозяйственная операция выдачи бейджа обучающемуся</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бейдж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бейджи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БаллыОпыта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ПопыткаТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПопыткаТеста</Name>
			<Comment>Сессия адаптивного тестирования с пошаговой историей ответов</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяОценкаТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяSE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерШага</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТестовыеЗадания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Верно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяОценкаТета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяSE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/CommonModules/Геймификация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Начисляет баллы опыта обучающемуся: создаёт документ НачислениеБаллов
// и регистрирует движение в регистре накопления БаллыОпыта.
//
// Параметры:
//  Пользователь   - Строка - ФИО обучающегося.
//  Тема           - СправочникСсылка.Темы - тема (может быть Неопределено).
//  Причина        - ПеречислениеСсылка.ПричиныНачисленияБаллов - причина начисления.
//  Количество     - Число - количество начисляемых баллов.
//  ИсточникСсылка - ЛюбаяСсылка - объект-источник начисления (может быть Неопределено).
//  Комментарий    - Строка - произвольный комментарий.
//
Процедура НачислитьБаллы(Знач Пользователь, Знач Тема, Знач Причина,
                        Знач Количество, Знач ИсточникСсылка = Неопределено,
                        Знач Комментарий = "") Экспорт
    
    Попытка
        Документ = Документы.НачислениеБаллов.СоздатьДокумент();
        Документ.Дата           = ТекущаяДатаСеанса();
        Документ.Обучающийся    = Пользователь;
        Документ.Тема           = Тема;
        Документ.Причина        = Причина;
        Документ.ИсточникСсылка = ИсточникСсылка;
        Документ.Количество     = Количество;
        Документ.Комментарий    = Комментарий;
        // Движения по регистру БаллыОпыта формируются при проведении документа
        // (см. модуль объекта Документ.НачислениеБаллов.ОбработкаПроведения).
        Документ.Записать(РежимЗаписиДокумента.Проведение);

        АналитикаПрогресса.ЗарегистрироватьСобытие(
            Пользователь, Тема,
            Перечисления.ТипыСобытийАналитики.НачислениеБаллов,
            Новый Структура("Количество, Причина", Количество, Строка(Причина)),
            Документ.Ссылка);
        
    Исключение
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(
            "Геймификация.НачислитьБаллы", ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры

// Проверяет, не пора ли выдать обучающемуся какие-либо бейджи.
// Перебирает все активные бейджи и оценивает их условия активации.
//
// Параметры:
//  Пользователь - Строка - ФИО обучающегося.
//
Процедура ПроверитьУсловияБейджей(Знач Пользователь) Экспорт
    
    // Предварительно (вне цикла) читаем агрегаты пользователя и набор уже выданных
    // бейджей — это исключает запросы к базе внутри цикла перебора бейджей.
    Метрики        = МетрикиПользователя(Пользователь);
    ВыданныеБейджи = ВыданныеБейджиПользователя(Пользователь);

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   УсловияАктивации.Ссылка                    КАК Бейдж,
        |   УсловияАктивации.Ссылка.БаллыЗаПолучение   КАК БаллыОпыта,
        |   УсловияАктивации.ТипУсловия                КАК ТипУсловия,
        |   УсловияАктивации.Параметр                  КАК Параметр,
        |   УсловияАктивации.ПороговоеЗначение         КАК ПороговоеЗначение
        |ИЗ
        |   Справочник.Бейджи.УсловияАктивации КАК УсловияАктивации
        |ГДЕ
		|   НЕ УсловияАктивации.Ссылка.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО УсловияАктивации.Ссылка, УсловияАктивации.НомерСтроки");
    Выборка = Запрос.Выполнить().Выбрать();

    ТекущийБейдж = Неопределено;
    ВыполненыВсе = Истина;
    ЕстьУсловия  = Ложь;

    Пока Выборка.Следующий() Цикл
        Если Выборка.Бейдж <> ТекущийБейдж Тогда
            // Бейдж выдаётся только если у него есть хотя бы одно выполненное условие.
            Если ТекущийБейдж <> Неопределено И ЕстьУсловия И ВыполненыВсе Тогда
                ВыдатьБейджПоНабору(Пользователь, ТекущийБейдж, ВыданныеБейджи);
            КонецЕсли;
            ТекущийБейдж = Выборка.Бейдж;
            ВыполненыВсе = Истина;
            ЕстьУсловия  = Ложь;
        КонецЕсли;

        // Если есть строка условия, оценить её по предрассчитанным метрикам
        Если ЗначениеЗаполнено(Выборка.ТипУсловия) Тогда
            ЕстьУсловия = Истина;
            УсловиеВыполнено = ОценитьУсловиеПоМетрикам(
                Выборка.ТипУсловия, Выборка.ПороговоеЗначение, Метрики);
            ВыполненыВсе = ВыполненыВсе И УсловиеВыполнено;
        КонецЕсли;
    КонецЦикла;

    // Не забыть последний бейдж
    Если ТекущийБейдж <> Неопределено И ЕстьУсловия И ВыполненыВсе Тогда
        ВыдатьБейджПоНабору(Пользователь, ТекущийБейдж, ВыданныеБейджи);
    КонецЕсли;

КонецПроцедуры

// Пересчитывает рейтинг участников учебной группы и записывает позиции в регистр.
//
// Параметры:
//  УчебнаяГруппа - СправочникСсылка.УчебныеГруппы - учебная группа.
//
Процедура ОбновитьРейтинг(Знач УчебнаяГруппа) Экспорт
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Группа.Пользователь                          КАК Пользователь,
        |   ЕСТЬNULL(Баллы.КоличествоОборот, 0)          КАК СуммаБаллов,
        |   ЕСТЬNULL(ВыбТета.Тета, 0)                    КАК СредняяТета
        |ИЗ
        |   Справочник.УчебныеГруппы.Состав КАК Группа
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БаллыОпыта.Обороты() КАК Баллы
        |       ПО Баллы.Пользователь = Группа.Пользователь
        |   ЛЕВОЕ СОЕДИНЕНИЕ
        |       (ВЫБРАТЬ Пользователь, СРЕДНЕЕ(Тета) КАК Тета
        |        ИЗ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних
        |        СГРУППИРОВАТЬ ПО Пользователь) КАК ВыбТета
        |       ПО ВыбТета.Пользователь = Группа.Пользователь
        |ГДЕ
        |   Группа.Ссылка = &Группа
        |УПОРЯДОЧИТЬ ПО СуммаБаллов УБЫВ");
    Запрос.УстановитьПараметр("Группа", УчебнаяГруппа);
    
    // Снимок рейтинга на сегодня: замещаем записи за текущий день по этой группе,
    // не затрагивая историю предыдущих дней (Записать(Ложь) приводило к дублям).
    Период = НачалоДня(ТекущаяДатаСеанса());
    Выборка = Запрос.Выполнить().Выбрать();
    НаборЗаписей = РегистрыСведений.РейтинговыеПозиции.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.УчебнаяГруппа.Установить(УчебнаяГруппа);
    НаборЗаписей.Отбор.Период.Установить(Период);
    Ранг = 0;
    Пока Выборка.Следующий() Цикл
        Ранг = Ранг + 1;
        Запись = НаборЗаписей.Добавить();
        Запись.Период        = Период;
        Запись.УчебнаяГруппа = УчебнаяГруппа;
        Запись.Пользователь  = Выборка.Пользователь;
        Запись.СуммаБаллов   = Выборка.СуммаБаллов;
        Запись.Ранг          = Ранг;
        Запись.СредняяТета   = Выборка.СредняяТета;
    КонецЦикла;
    НаборЗаписей.Записать(Истина);
    
КонецПроцедуры

// Выдаёт бейдж обучающемуся (создаёт документ ВыдачаБейджа).
//
// Параметры:
//  Пользователь   - Строка - ФИО обучающегося.
//  Бейдж          - СправочникСсылка.Бейджи - выдаваемый бейдж.
//  ИсточникСсылка - ЛюбаяСсылка - объект-источник выдачи (может быть Неопределено).
//
Процедура ВыдатьБейдж(Знач Пользователь, Знач Бейдж, Знач ИсточникСсылка = Неопределено) Экспорт

    ВыдатьБейджЕслиНетУже(Пользователь, Бейдж, ИсточникСсылка);

КонецПроцедуры

// Возвращает агрегатные метрики обучающегося, используемые в условиях бейджей
// и для расчёта прогресса к ним: СуммаБаллов, ЗавершеноТем, ЗавершеноКурсов, МаксСерия.
//
// Параметры:
//  Пользователь - Строка - ФИО обучающегося.
//
// Возвращаемое значение:
//  Структура - см. МетрикиПользователя.
//
Функция МетрикиОбучающегося(Знач Пользователь) Экспорт

    Возврат МетрикиПользователя(Пользователь);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыдатьБейджЕслиНетУже(Знач Пользователь, Знач Бейдж, Знач ИсточникСсылка)

    // Точечная выдача: проверяем запросом, что бейдж ещё не выдан. Полная сериализация
    // при параллельных вызовах требует отдельного ресурса блокировки (напр. регистра
    // выданных бейджей) — текущая проверка best-effort (см. ревью).
    Если БейджУжеВыдан(Пользователь, Бейдж) Тогда
        Возврат;
    КонецЕсли;

    ВыдатьБейджБезПроверки(Пользователь, Бейдж, ИсточникСсылка);

КонецПроцедуры

// Выдаёт бейдж, отсутствующий в переданном наборе уже выданных, без запроса к базе.
// Применяется в массовых проверках, где набор выданных бейджей прочитан заранее
// одним запросом (см. ПроверитьУсловияБейджей).
//
// Параметры:
//  Пользователь   - Строка       - ФИО обучающегося.
//  Бейдж          - СправочникСсылка.Бейджи - выдаваемый бейдж.
//  ВыданныеБейджи - Соответствие - СправочникСсылка.Бейджи -> Булево (уже выданные бейджи).
//
Процедура ВыдатьБейджПоНабору(Знач Пользователь, Знач Бейдж, ВыданныеБейджи)

    Если ВыданныеБейджи.Получить(Бейдж) <> Неопределено Тогда
        Возврат;
    КонецЕсли;

    ВыдатьБейджБезПроверки(Пользователь, Бейдж, Неопределено);
    ВыданныеБейджи.Вставить(Бейдж, Истина);

КонецПроцедуры

// Создаёт документ выдачи бейджа и выполняет побочные эффекты БЕЗ повторной проверки
// «не выдан». Вызывающий код обязан гарантировать отсутствие дубля (запросом или по
// предварительно прочитанному набору выданных бейджей).
//
// Параметры:
//  Пользователь   - Строка       - ФИО обучающегося.
//  Бейдж          - СправочникСсылка.Бейджи - выдаваемый бейдж.
//  ИсточникСсылка - ЛюбаяСсылка   - объект-источник выдачи (может быть Неопределено).
//
Процедура ВыдатьБейджБезПроверки(Знач Пользователь, Знач Бейдж, Знач ИсточникСсылка)

    БаллыЗаПолучение = ОбщегоНазначенияСерверПриложение.ЗначениеРеквизитаОбъекта(
        Бейдж, "БаллыЗаПолучение");

    БейджВыдан = Ложь;
    НачатьТранзакцию();
    Попытка
        Документ = Документы.ВыдачаБейджа.СоздатьДокумент();
        Документ.Дата                  = ТекущаяДатаСеанса();
        Документ.Обучающийся           = Пользователь;
        Документ.Бейдж                 = Бейдж;
        Документ.ДатаВыдачи            = ТекущаяДатаСеанса();
        Документ.ИсточникСсылка        = ИсточникСсылка;
        Документ.БаллыОпыта            = БаллыЗаПолучение;
        Документ.ОтображатьУведомление = Истина;
        Документ.Записать(РежимЗаписиДокумента.Проведение);

        ЗафиксироватьТранзакцию();
        БейджВыдан = Истина;
    Исключение
        ОтменитьТранзакцию();
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(
            "Геймификация.ВыдатьБейдж", ОписаниеОшибки());
    КонецПопытки;

    Если Не БейджВыдан Тогда
        Возврат;
    КонецЕсли;

    // Побочные эффекты — вне транзакции выдачи (best-effort, не должны её откатывать).
    Если БаллыЗаПолучение > 0 Тогда
        НачислитьБаллы(Пользователь, Неопределено,
            Перечисления.ПричиныНачисленияБаллов.ПолучениеБейджа,
            БаллыЗаПолучение, Документ.Ссылка,
            СтрШаблон(НСтр("ru = 'Получен бейдж: %1'"), Строка(Бейдж)));
    КонецЕсли;

    АналитикаПрогресса.ЗарегистрироватьСобытие(
        Пользователь, Неопределено,
        Перечисления.ТипыСобытийАналитики.ПолучениеБейджа,
        Новый Структура("Бейдж", Строка(Бейдж)),
        Документ.Ссылка);

КонецПроцедуры

// Проверяет, выдан ли уже бейдж обучающемуся (без учёта помеченных на удаление).
//
Функция БейджУжеВыдан(Знач Пользователь, Знач Бейдж)

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   ВыдачаБейджа.Ссылка КАК Ссылка
        |ИЗ
        |   Документ.ВыдачаБейджа КАК ВыдачаБейджа
        |ГДЕ
        |   ВыдачаБейджа.Обучающийся = &Пользователь
        |   И ВыдачаБейджа.Бейдж = &Бейдж
        |   И НЕ ВыдачаБейджа.ПометкаУдаления");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Бейдж",        Бейдж);

    РезультатЗапроса = Запрос.Выполнить();
    Возврат Не РезультатЗапроса.Пустой();

КонецФункции

// Возвращает набор уже выданных обучающемуся бейджей (без помеченных на удаление).
//
// Параметры:
//  Пользователь - Строка - ФИО обучающегося.
//
// Возвращаемое значение:
//  Соответствие - СправочникСсылка.Бейджи -> Булево (выданные бейджи).
//
Функция ВыданныеБейджиПользователя(Знач Пользователь)

    Запрос = Новый Запрос(
        "ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   ВыдачаБейджа.Бейдж КАК Бейдж
        |ИЗ
        |   Документ.ВыдачаБейджа КАК ВыдачаБейджа
        |ГДЕ
        |   ВыдачаБейджа.Обучающийся = &Пользователь
        |   И НЕ ВыдачаБейджа.ПометкаУдаления");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);

    Результат = Новый Соответствие;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Результат.Вставить(Выборка.Бейдж, Истина);
    КонецЦикла;
    Возврат Результат;

КонецФункции

// Рассчитывает агрегатные метрики обучающегося, используемые в условиях активации
// бейджей. Выполняется один раз вне цикла перебора бейджей.
//
// Параметры:
//  Пользователь - Строка - ФИО обучающегося.
//
// Возвращаемое значение:
//  Структура - СуммаБаллов (Число), ЗавершеноТем (Число), ЗавершеноКурсов (Число),
//              МаксСерия (Число).
//
Функция МетрикиПользователя(Знач Пользователь)

    ПорогТета = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ПорогТетаДляПрохожденияТемы");

    Метрики = Новый Структура;
    Метрики.Вставить("СуммаБаллов",     0);
    Метрики.Вставить("ЗавершеноТем",    0);
    Метрики.Вставить("ЗавершеноКурсов", 0);
    Метрики.Вставить("МаксСерия",       0);

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ЕСТЬNULL(СУММА(Обороты.КоличествоОборот), 0) КАК Сумма
        |ИЗ РегистрНакопления.БаллыОпыта.Обороты(, , , Пользователь = &Пользователь) КАК Обороты");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Метрики.СуммаБаллов = Выборка.Сумма;
    КонецЕсли;

    Запрос = Новый Запрос(
        "ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Кол
        |ИЗ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних(, Пользователь = &Пользователь И Тета >= &Порог) КАК СП");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Порог",        ПорогТета);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Метрики.ЗавершеноТем = Выборка.Кол;
    КонецЕсли;

    Метрики.ЗавершеноКурсов = ЧислоЗавершённыхКурсов(Пользователь);
    Метрики.МаксСерия       = МаксСерияВерныхОтветов(Пользователь);

    Возврат Метрики;

КонецФункции

// Оценивает, выполнено ли условие активации бейджа по предрассчитанным метрикам.
// Типы условий: "СуммаБаллов", "ЗавершеноТем", "ЗавершеноКурсов", "ВерныхОтветовПодряд".
//
// Параметры:
//  ТипУсловия - Строка    - тип проверяемого условия.
//  Порог      - Число     - пороговое значение условия.
//  Метрики    - Структура - агрегатные метрики обучающегося (см. МетрикиПользователя).
//
// Возвращаемое значение:
//  Булево - Истина, если условие выполнено.
//
Функция ОценитьУсловиеПоМетрикам(Знач ТипУсловия, Знач Порог, Знач Метрики)

    Если ТипУсловия = "СуммаБаллов" Тогда
        Возврат Метрики.СуммаБаллов >= Порог;
    ИначеЕсли ТипУсловия = "ЗавершеноТем" Тогда
        Возврат Метрики.ЗавершеноТем >= Порог;
    ИначеЕсли ТипУсловия = "ЗавершеноКурсов" Тогда
        Возврат Метрики.ЗавершеноКурсов >= Порог;
    ИначеЕсли ТипУсловия = "ВерныхОтветовПодряд" Тогда
        Возврат Метрики.МаксСерия >= Порог;
    КонецЕсли;

    Возврат Ложь;

КонецФункции

// Возвращает число курсов, у которых все темы пройдены (θ >= порога прохождения).
// Курс без тем завершённым не считается.
//
Функция ЧислоЗавершённыхКурсов(Знач Пользователь)

    ПорогТета = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ПорогТетаДляПрохожденияТемы");

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Темы.Владелец КАК Курс,
        |   КОЛИЧЕСТВО(Темы.Ссылка) КАК ВсегоТем,
        |   СУММА(ВЫБОР КОГДА ЕСТЬNULL(СП.Тета, -99) >= &Порог ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК Пройдено
        |ИЗ
        |   Справочник.Темы КАК Темы
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних(, Пользователь = &Пользователь) КАК СП
        |       ПО СП.Тема = Темы.Ссылка
        |ГДЕ
        |   НЕ Темы.ПометкаУдаления
        |СГРУППИРОВАТЬ ПО Темы.Владелец");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Порог",        ПорогТета);

    Завершено = 0;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Если Выборка.ВсегоТем > 0 И Выборка.Пройдено = Выборка.ВсегоТем Тогда
            Завершено = Завершено + 1;
        КонецЕсли;
    КонецЦикла;
    Возврат Завершено;

КонецФункции

// Возвращает максимальную серию подряд идущих верных ответов обучающегося
// по всем его сессиям (по хронологии: дата начала сессии, затем номер шага).
//
Функция МаксСерияВерныхОтветов(Знач Пользователь)

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |	Ответы.Верно КАК Верно
        |ИЗ
        |	Документ.ПопыткаТеста.Ответы КАК Ответы
        |ГДЕ
        |	Ответы.Ссылка.Обучающийся = &Пользователь
        |	И НЕ Ответы.Ссылка.ПометкаУдаления
        |
        |УПОРЯДОЧИТЬ ПО
        |	Ответы.Ссылка.ДатаНачала,
        |	Ответы.НомерШага");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);

    МаксСерия = 0;
    Текущая   = 0;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Если Выборка.Верно Тогда
            Текущая = Текущая + 1;
            Если Текущая > МаксСерия Тогда
                МаксСерия = Текущая;
            КонецЕсли;
        Иначе
            Текущая = 0;
        КонецЕсли;
    КонецЦикла;
    Возврат МаксСерия;

КонецФункции

#КонецОбласти
